app/controllers/static_pages_controller.rb

  def help
    User.all.each do |user|
---
SELECT "users".* FROM "users"