app/controllers/users_controller.rb

  def index
    @users = User.where(activated: FILL_IN).paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = $1 LIMIT $2 OFFSET $3  [["activated", true], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = $1  [["activated", true]]